# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: "Star Wars" }, { name: "Lord of the Rings" }])
#   Character.create(name: "Luke", movie: movies.first)
Rule.create([{title:"Загальні положення", body:"1.1 Ці Правила відповідно до Закону України «Про дорожній рух» встановлюють єдиний порядок дорожнього руху на всій території України.

    Інші нормативні акти, що стосуються особливостей дорожнього руху (перевезення спеціальних вантажів, експлуатація транспортних засобів окремих видів, рух на закритій території тощо), повинні ґрунтуватися на вимогах цих Правил.
    
    1.2
    В Україні установлено правосторонній рух транспортних засобів.
    
    1.3
    Учасники дорожнього руху зобов'язані знати й неухильно виконувати вимоги цих Правил, а також бути взаємно ввічливими.
    
    1.4
    Кожний учасник дорожнього руху має право розраховувати на те, що й інші учасники виконують ці Правила.
    
    1.5
    Дії або бездіяльність учасників дорожнього руху та інших осіб не повинні створювати небезпеку чи перешкоду для руху, загрожувати життю або здоров'ю громадян, завдавати матеріальних збитків.
    
    Розглянемо приклад
    
    Особа, яка створила такі умови, зобов'язана негайно вжити заходів до забезпечення безпеки дорожнього руху на цій ділянці дороги та вжити всіх можливих заходів до усунення перешкод, а якщо це неможливо, попередити про них інших учасників дорожнього руху, повідомити уповноважений підрозділ Національної поліції, власника дороги або уповноважений ним орган.
    
    1.6
    Використовувати дороги не за їх призначенням дозволяється з урахуванням вимог статей 36-38 Закону України «Про автомобільні дороги».

    1.7
    Водії зобов’язані бути особливо уважними до таких категорій учасників дорожнього руху, як велосипедисти, особи, які рухаються в кріслах колісних, та пішоходи. Усі учасники дорожнього руху повинні бути особливо обережними до дітей, людей похилого віку та осіб з явними ознаками інвалідності.
    
    1.8
    Обмеження в дорожньому русі, крім передбачених цими Правилами, можуть бути запроваджені в установленому законодавством порядку.
    
    1.9
    Особи, які порушують ці Правила, несуть відповідальність згідно із законодавством.
    
    1.10
    Терміни, що наведені у цих Правилах, мають таке значення:
    
    автобус — автомобіль з кількістю місць для сидіння більше дев'яти з місцем водія включно, який за своєю конструкцією та обладнанням призначений для перевезення пасажирів та їхнього багажу із забезпеченням необхідного комфорту та безпеки;
    
    автомагістраль — автомобільна дорога, що:
    
    спеціально побудована і призначена для руху транспортних засобів, не призначена для в’їзду на прилеглу територію або виїзду з неї;
    
    має для кожного напрямку руху окремі проїзні частини, відокремлені одна від іншої розділювальною смугою;
    
    не перетинає на одному рівні інші дороги, залізничні і трамвайні колії, пішохідні і велосипедні доріжки, шляхи проходу тварин, має огородження на узбіччях і розділювальній смузі та обгороджена сіткою;
    
    позначена дорожнім знаком 5.1 5.1 Автомагістраль;
    
    автомобільна дорога, вулиця (дорога) — частина території, в тому числі в населеному пункті, призначена для руху транспортних засобів і пішоходів, з усіма розташованими на ній спорудами (мостами, шляхопроводами, естакадами, надземними і підземними пішохідними переходами) та засобами організації дорожнього руху, і обмежена по ширині зовнішнім краєм тротуарів чи краєм смуги відводу. Цей термін включає також спеціально побудовані тимчасові дороги, крім довільно накатаних доріг (колій);
    
    автомобільні дороги державного значення — автомобільні дороги загального користування, до яких належать міжнародні, національні, регіональні та територіальні автомобільні дороги, які позначені відповідними дорожніми знаками;
    
    автопоїзд (транспортний состав) — механічний транспортний засіб, що з’єднаний з одним або кількома причепами за допомогою зчіпного пристрою;
    
    безпечна дистанція — відстань до транспортного засобу, що рухається попереду по тій самій смузі, яка у разі його раптового гальмування або зупинки дасть можливість водієві транспортного засобу, що рухається позаду, запобігти зіткненню без здійснення будь-якого маневру;
    
    безпечний інтервал — відстань між боковими частинами транспортних засобів, що рухаються, або між ними та іншими об'єктами, за якої гарантована безпека дорожнього руху;
    
    безпечна швидкість — швидкість, за якої водій має змогу безпечно керувати транспортним засобом та контролювати його рух у конкретних дорожніх умовах;
    
    буксирування — переміщення одним транспортним засобом іншого транспортного засобу, яке не належить до експлуатації автопоїздів (транспортних составів) на жорсткому чи гнучкому зчепленні або способом часткового навантаження на платформу чи на спеціальне опорне пристосування;
    
    вантажний автомобіль — автомобіль, який за своєю конструкцією та обладнанням призначений для перевезення вантажів;
    
    велосипед — транспортний засіб, крім крісел колісних, що приводиться в рух мускульною силою людини, яка знаходиться на ньому;
    
    велосипедист — особа, яка керує велосипедом;
    
    велосипедна доріжка — доріжка з покриттям поза межами проїзної частини вулиці та/або дороги, розташована окремо чи суміжно з тротуаром або пішохідною доріжкою, що призначена для руху на велосипедах, і позначена дорожнім знаком 4.14 4.14 Доріжка для велосипедистів та горизонтальною розміткою 1.36 Розмітка 1.36;
    
    велосипедна смуга — смуга, призначена для руху на велосипедах у межах проїзної частини вулиці та/або дороги, яка позначена дорожнім знаком 5.88 5.88 Велосипедна смуга та відповідною горизонтальною дорожньою розміткою;
    
    велосипедний переїзд — місце перетину велосипедистами проїзної частини в межах перехрестя або поза ними, позначене дорожньою розміткою 1.15 Розмітка 1.15 (велосипедний переїзд);
    
    видимість у напрямку руху — максимальна відстань, на якій з місця водія можна чітко розпізнати межі елементів дороги та розміщення учасників руху, що дає змогу водієві орієнтуватися під час керування транспортним засобом, зокрема для вибору безпечної швидкості та здійснення безпечного маневру;
    
    вимушена зупинка — припинення руху транспортного засобу через його технічну несправність чи небезпеку, яка спричинена вантажем, який перевозиться, станом учасника дорожнього руху, появою перешкоди для руху;
    
    випередження — рух транспортного засобу із швидкістю, що перевищує швидкість попутного транспортного засобу, що рухається поряд по суміжній смузі;
    
    власник транспортного засобу — фізична або юридична особа, яка володіє майновими правами на транспортний засіб, що підтверджується відповідними документами;
    
    водій — особа, яка керує транспортним засобом і має посвідчення водія (посвідчення тракториста-машиніста, тимчасовий дозвіл на право керування транспортним засобом, тимчасовий талон на право керування транспортним засобом) відповідної категорії. Водієм також є особа, яка навчає керуванню транспортним засобом, перебуваючи безпосередньо в транспортному засобі;
    
    габаритно-ваговий контроль — перевірка габаритних і вагових параметрів транспортного засобу (в тому числі механічного транспортного засобу), причепу і вантажу на предмет відповідності встановленим нормам щодо габаритів (ширина, висота від поверхні дороги, довжина транспортного засобу) та щодо навантаження (фактична маса, осьове навантаження), яка проводиться відповідно до встановленого порядку на стаціонарних або пересувних пунктах габаритно-вагового контролю;
    
    газон — ділянка однорідної території із дерновим покривом, який штучно створюється шляхом посіву і вирощування дерноутворювальних трав (переважно багаторічних злаків) або одернування;
    
    гальмовий шлях — відстань, що проходить транспортний засіб під час екстреного гальмування з початку здійснення впливу на орган керування гальмовою системою (педаль, рукоятку) до місця його зупинки;
    
    головна дорога — дорога з покриттям відносно ґрунтової
    
    або та, що позначається знаками 1.22 1.22 Перехрещення з другорядною дорогою, 1.23.1 1.23.1 Прилягання другорядної дороги, 1.23.2 1.23.2 Прилягання другорядної дороги, 1.23.3 1.23.3 Прилягання другорядної дороги, 1.23.4 1.23.4 Прилягання другорядної дороги, 2.3 2.3 Головна дорога.
    
    Наявність на другорядній дорозі покриття безпосередньо перед перехрестям не прирівнює її за значенням до перехрещуваної;
    
    дати дорогу — вимога до учасника дорожнього руху не продовжувати або не відновлювати рух, не здійснювати будь-яких маневрів (за винятком вимоги звільнити займану смугу руху), якщо це може примусити інших учасників дорожнього руху, які мають перевагу, змінити напрямок руху або швидкість;
    
    денні ходові вогні — зовнішні світлові прилади білого кольору, передбачені конструкцією транспортного засобу, установлені спереду транспортного засобу і призначені для покращення видимості транспортного засобу під час його руху у світлий час доби;
    
    дитяча утримуюча система — обладнання, що здатне утримувати дитину в сидячому або нахиленому положенні, яка у разі зіткнення або різкого гальмування транспортного засобу зменшує небезпеку травмування дитини, що в ньому перебуває, шляхом обмеження рухливості її тіла;
    
    дозволена максимальна маса — маса спорядженого транспортного засобу з вантажем, водієм і пасажирами, що встановлена технічною характеристикою транспортного засобу як максимально допустима. Дозволена максимальна маса автопоїзда — це сума дозволеної максимально допустимої маси кожного транспортного засобу, що входить до складу автопоїзда;
    
    дозволене максимальне навантаження на вісь — максимальне навантаження на вісь транспортного засобу, зазначене у підпункті в пункту 22.5 цих Правил;
    
    дозволені максимальні розміри — максимальні розміри транспортного засобу, зазначені у підпункті a пункту 22.5 цих Правил;
    
    дорожньо-транспортна пригода — подія, що сталася під час руху транспортного засобу, внаслідок якої загинули або поранені люди чи завдані матеріальні збитки;
    
    дорожні роботи — роботи, пов’язані з будівництвом, реконструкцією, ремонтом чи утриманням автомобільної дороги (вулиці), штучних споруд, споруд дорожнього водовідводу, інженерного облаштування, встановленням (ремонтом, заміною) технічних засобів організації дорожнього руху;
    
    дорожні умови — сукупність факторів, що характеризують (з урахуванням пори року, періоду доби, атмосферних явищ, освітленості дороги) видимість у напрямку руху, стан поверхні проїзної частини (чистота, рівність, шорсткість, зчеплення), а також її ширину, величину похилів на спусках і підйомах, віражів і заокруглень, наявність тротуарів або узбіч, засобів організації дорожнього руху та їх стан;
    
    дорожня обстановка — сукупність факторів, що характеризуються дорожніми умовами, наявністю перешкод на певній ділянці дороги, інтенсивністю і рівнем організації дорожнього руху (наявність дорожньої розмітки, дорожніх знаків, дорожнього обладнання, світлофорів та їх стан), які повинен ураховувати водій під час вибору швидкості, смуги руху та прийомів керування транспортним засобом;
    
    дорожня станція патрульної поліції  — позначена дорожнім знаком 6.10 6.10 Дорожні станції патрульної поліції ділянка місцевості поблизу проїзної частини дороги з розташованою на ній будівлею або іншою спорудою, призначеною для перебування в ній поліцейських патрульної поліції під час несення ними служби;
    
    експлуатація транспортного состава — транспортування тягачем причепа згідно з інструкцією щодо його використання (відповідність причепа тягачу, наявність страхового з'єднання, єдиної системи сигналізації, освітлення тощо);
    
    естакада — інженерна споруда для руху транспортних засобів та (або) пішоходів, підняття однієї дороги над іншою у місці їх перетину, а також для створення дороги на певній висоті, яка не має з'їздів на іншу дорогу;
    
    житлова зона — дворові території, а також частини населених пунктів, позначені дорожнім знаком 5.34 5.34 Житлова зона;
    
    залишення місця дорожньо-транспортної пригоди — дії учасника дорожньо-транспортної пригоди, спрямовані на приховання факту такої пригоди або обставин її скоєння, які спричинили необхідність проведення поліцейськими заходів щодо встановлення (розшуку) цього учасника та (або) розшуку транспортного засобу;
    
    залізничний переїзд — перехрещення дороги із залізничними коліями на одному рівні;
    
    засліплення — фізіологічний стан водія внаслідок дії світла на його зір, коли водій об'єктивно не має можливості виявити перешкоди чи розпізнати межі елементів дороги на мінімальній відстані;
    
    зупинка — припинення руху транспортного засобу на час до 5 хвилин або більше, якщо це необхідно для посадки (висадки) пасажирів чи завантаження (розвантаження) вантажу, виконання вимог цих Правил (надання переваги в русі, виконання вимог регулювальника, сигналів світлофора тощо);
    
    колона пішоходів — організована група людей, які рухаються по проїзній частині в одному напрямку;
    
    колона транспортних засобів — організована група з трьох і більше транспортних засобів, що разом рухаються в одному напрямку безпосередньо один за одним з постійно увімкненим ближнім світлом фар;
    
    край проїзної частини (для нерейкових транспортних засобів) — видима умовна чи позначена дорожньою розміткою лінія на проїзній частині в місці її прилягання до узбіччя, тротуару, газону, розділювальної смуги, смуги для руху трамваїв, велосипедної або пішохідної доріжки;

    крайнє положення на проїзній частині — положення транспортного засобу на відстані від краю проїзної частини (середини проїзної частини або розділювальної смуги), яка не дає можливості рухатися попутному транспортному засобу (у тому числі двоколісному) ще ближче до краю проїзної частини (середини проїзної частини або розділювальної смуги);
    
    крісло колісне — спеціально сконструйований колісний засіб, який призначений для руху на дорозі осіб з інвалідністю або осіб, які відносяться до інших маломобільних груп населення. Крісло колісне має щонайменше двоє коліс та обладнується двигуном чи приводиться в рух мускульною силою людини;
    
    легковий автомобіль — автомобіль з кількістю місць для сидіння не більше дев'яти, з місцем водія включно, який за своєю конструкцією та обладнанням призначений для перевезення пасажирів та їхнього багажу із забезпеченням необхідного комфорту та безпеки;
    
    маневрування (маневр) — початок руху, перестроювання транспортного засобу в русі з однієї смуги на іншу, поворот праворуч чи ліворуч, розворот, з’їзд з проїзної частини, рух заднім ходом;

    маршрутні транспортні засоби (транспортні засоби загального користування) — автобуси, мікроавтобуси, тролейбуси, трамваї і таксі, що рухаються за встановленими маршрутами та мають визначені місця на дорозі для посадки (висадки) пасажирів;
     
    механічний транспортний засіб — транспортний засіб, що приводиться в рух з допомогою двигуна. Цей термін поширюється на трактори, самохідні машини і механізми, а також тролейбуси та транспортні засоби з електродвигуном потужністю понад 3 кВт;
    
    мікроавтобус — одноповерховий автобус з кількістю місць для сидіння не більше сімнадцяти з місцем водія включно;
    
    міст — споруда, призначена для руху через річку, яр та інші перешкоди, межами якої є початок і кінець пролітних споруд;
    
    мопед — двоколісний транспортний засіб, що має двигун з робочим об'ємом до 50 куб. см або електродвигун потужністю до 4 кВт;
    
    мотоцикл — двоколісний механічний транспортний засіб з боковим причепом або без нього, що має двигун з робочим об'ємом 50 куб. см і більше. До мотоциклів прирівнюються моторолери, мотоколяски, триколісні та інші механічні транспортні засоби, дозволена максимальна маса яких не перевищує 400 кг;
    
    шляхопровід — інженерна споруда мостового типу над іншою дорогою (залізницею) в місці їх перетину, що забезпечує рух по ній на різних рівнях та дає можливість з’їзду на іншу дорогу.
    
    "}])