# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: "Star Wars" }, { name: "Lord of the Rings" }])
#   Character.create(name: "Luke", movie: movies.first)
Rule.create([{title:"Загальні положення", body:"1.1 Ці Правила відповідно до Закону України «Про дорожній рух» встановлюють єдиний порядок дорожнього руху на всій території України.

    Інші нормативні акти, що стосуються особливостей дорожнього руху (перевезення спеціальних вантажів, експлуатація транспортних засобів окремих видів, рух на закритій території тощо), повинні ґрунтуватися на вимогах цих Правил.
    
    1.2
    В Україні установлено правосторонній рух транспортних засобів.
    
    1.3
    Учасники дорожнього руху зобов'язані знати й неухильно виконувати вимоги цих Правил, а також бути взаємно ввічливими.
    
    1.4
    Кожний учасник дорожнього руху має право розраховувати на те, що й інші учасники виконують ці Правила.
    
    1.5
    Дії або бездіяльність учасників дорожнього руху та інших осіб не повинні створювати небезпеку чи перешкоду для руху, загрожувати життю або здоров'ю громадян, завдавати матеріальних збитків.
    
    Розглянемо приклад
    
    Особа, яка створила такі умови, зобов'язана негайно вжити заходів до забезпечення безпеки дорожнього руху на цій ділянці дороги та вжити всіх можливих заходів до усунення перешкод, а якщо це неможливо, попередити про них інших учасників дорожнього руху, повідомити уповноважений підрозділ Національної поліції, власника дороги або уповноважений ним орган.
    
    1.6
    Використовувати дороги не за їх призначенням дозволяється з урахуванням вимог статей 36-38 Закону України «Про автомобільні дороги».

    1.7
    Водії зобов’язані бути особливо уважними до таких категорій учасників дорожнього руху, як велосипедисти, особи, які рухаються в кріслах колісних, та пішоходи. Усі учасники дорожнього руху повинні бути особливо обережними до дітей, людей похилого віку та осіб з явними ознаками інвалідності.
    
    1.8
    Обмеження в дорожньому русі, крім передбачених цими Правилами, можуть бути запроваджені в установленому законодавством порядку.
    
    1.9
    Особи, які порушують ці Правила, несуть відповідальність згідно із законодавством.
    
    "}])
